### INCOMING STAGE INFRASTRUCTURE CHANGES:
#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/elation/gh-actions-for-infra-ci-demo_stage/runs/run-tvPerEoY8PwZx8vf

Waiting for the plan to start...

Terraform v1.0.5
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_s3_bucket.host_bucket: Refreshing state... [id=stage-gh-actions-for-infra-ci-demo.elationhealth.com]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_s3_bucket.host_bucket has been changed
  ~ resource "aws_s3_bucket" "host_bucket" {
      + arn                         = "arn:aws:s3:::stage-gh-actions-for-infra-ci-demo.elationhealth.com"
      + bucket_domain_name          = "stage-gh-actions-for-infra-ci-demo.elationhealth.com.s3.amazonaws.com"
      + bucket_regional_domain_name = "stage-gh-actions-for-infra-ci-demo.elationhealth.com.s3.us-west-1.amazonaws.com"
      + hosted_zone_id              = "Z2F56UZL2M1ACD"
        id                          = "stage-gh-actions-for-infra-ci-demo.elationhealth.com"
      + region                      = "us-west-1"
      + request_payer               = "BucketOwner"
      ~ tags                        = {
          - "Environment" = "stage" -> null
          - "Name"        = "Demo source bucket (GH Actions for Infra CI Demo)" -> null
        }
      ~ tags_all                    = {
          - "Environment" = "stage" -> null
          - "Name"        = "Demo source bucket (GH Actions for Infra CI Demo)" -> null
        }
        # (3 unchanged attributes hidden)

      + versioning {
          + enabled    = false
          + mfa_delete = false
        }

      - website {
          - error_document = "error.html" -> null
          - index_document = "stage-index.html" -> null
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_bucket.host_bucket is tainted, so must be replaced
-/+ resource "aws_s3_bucket" "host_bucket" {
      + acceleration_status         = (known after apply)
      ~ arn                         = "arn:aws:s3:::stage-gh-actions-for-infra-ci-demo.elationhealth.com" -> (known after apply)
      ~ bucket                      = "stage-gh-actions-for-infra-ci-demo.elationhealth.com" -> "stage-gh-actions-for-infra-ci-demo-source"
      ~ bucket_domain_name          = "stage-gh-actions-for-infra-ci-demo.elationhealth.com.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "stage-gh-actions-for-infra-ci-demo.elationhealth.com.s3.us-west-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z2F56UZL2M1ACD" -> (known after apply)
      ~ id                          = "stage-gh-actions-for-infra-ci-demo.elationhealth.com" -> (known after apply)
      ~ region                      = "us-west-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      ~ tags                        = {
          + "Environment" = "stage"
          + "Name"        = "Demo source bucket (GH Actions for Infra CI Demo)"
        }
      ~ tags_all                    = {
          + "Environment" = "stage"
          + "Name"        = "Demo source bucket (GH Actions for Infra CI Demo)"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      ~ versioning {
          ~ enabled    = false -> (known after apply)
          ~ mfa_delete = false -> (known after apply)
        }

      + website {
          + error_document = "error.html"
          + index_document = "stage-index.html"
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + bucket_name = (known after apply)

------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 0 estimated
           $0.0/mo +$0.0

```

</details>

*Pusher: @landonnewberry, Action: `pull_request`*